ErwanCheriaux/ZeROSEro7/Training/BLE_nrf52/ble_peripheral_gatt.c
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_assert.h"
#include "app_error.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advertising.h"
#include "ble_advdata.h"
#include "ble_hids.h"
#include "ble_bas.h"
#include "ble_dis.h"
#include "ble_conn_params.h"
#include "bsp_btn_ble.h"
#include "app_scheduler.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "peer_manager.h"
#include "fds.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define PNP_ID_VENDOR_ID_SOURCE 0x00C3 /**< Vendor ID Source. */
#define PNP_ID_VENDOR_ID 0x1915        /**< Vendor ID. */
#define PNP_ID_PRODUCT_ID 0xEEEE       /**< Product ID. */
#define PNP_ID_PRODUCT_VERSION 0x0001  /**< Product Version. */

#define MANUFACTURER_NAME "adidas ag" /**< Manufacturer. Will be passed to Device Information Service. */

NRF_BLE_GATT_DEF(m_gatt); /**< GATT module instance. */

void my_service_init()
{
    // TODO custom service

    ret_code_t       err_code;
    ble_dis_init_t   dis_init_obj;
    ble_dis_pnp_id_t pnp_id;

    pnp_id.vendor_id_source = PNP_ID_VENDOR_ID_SOURCE;
    pnp_id.vendor_id        = PNP_ID_VENDOR_ID;
    pnp_id.product_id       = PNP_ID_PRODUCT_ID;
    pnp_id.product_version  = PNP_ID_PRODUCT_VERSION;

    memset(&dis_init_obj, 0, sizeof(dis_init_obj));

    ble_srv_ascii_to_utf8(&dis_init_obj.manufact_name_str, MANUFACTURER_NAME);
    dis_init_obj.p_pnp_id = &pnp_id;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init_obj.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init_obj.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init_obj);
    APP_ERROR_CHECK(err_code);
}

void ble_services_init()
{
    my_service_init();
}

void ble_gatt_init()
{
    APP_ERROR_CHECK(nrf_ble_gatt_init(&m_gatt, NULL));
}
